
export const FIGHTER_NAMES: string[] = [
  "マリオ", "ドンキーコング", "リンク", "サムス", "ダークサムス", "ヨッシー", "カービィ", "フォックス", "ピカチュウ", "ルイージ",
  "ネス", "キャプテン・ファルコン", "プリン", "ピーチ", "デイジー", "クッパ", "アイスクライマー", "シーク", "ゼルダ",
  "ドクターマリオ", "ピチュー", "ファルコ", "マルス", "ルキナ", "こどもリンク", "ガノンドロフ", "ミュウツー", "ロイ", "クロム",
  "Mr.ゲーム＆ウォッチ", "メタナイト", "ピット", "ブラックピット", "ゼロスーツサムス", "ワリオ", "スネーク", "アイク",
  "ポケモントレーナー", "ディディーコング", "リュカ", "ソニック", "デデデ大王", "オリマー", "ルカリオ", "ロボット",
  "トゥーンリンク", "ウルフ", "むらびと", "ロックマン", "Wii Fit トレーナー", "ロゼッタ", "リトル・マック", "ゲッコウガ",
  "パルテナ", "パックマン", "ルフレ", "シュルク", "クッパJr.", "ダックハント", "リュウ", "ケン", "クラウド", "カムイ",
  "ベヨネッタ", "インクリング", "リドリー", "シモン", "リヒター", "キングクルール", "しずえ", "ガオガエン",
  "パックンフラワー", "ジョーカー", "勇者", "バンジョー＆カズーイ", "テリー", "ベレト／ベレス", "ミェンミェン", "スティーブ", "セフィロス",
  "ホムラ／ヒカリ", "カズヤ", "ソラ"
];

export const GRID_SIZE = 25;
export const ASSASSIN_COUNT = 1;
// Starting team gets more agents. Counts will be decided based on who starts.
// For example, 9 for starting team, 8 for the other.
// Total agents = 17. Neutral = 25 - 17 - 1 = 7.
